[
  {
    "_id": 1,
    "name": "Module I",
    "list": [
      {
        "id": 1,
        "title": "Q.1. Write an essay on the Nature and salient features of Indian Constitution of India?",
        "description": "<h1>Write an essay on the Nature and salient features of Indian Constitution of India.</h1><p>   The Constitution of India is a unique constitution. It is the largest written democratic constitution of the world. It provides for a mixture of federalism and Unitarianism and flexibility and with rigidity. Since its inauguration on 26th January 1950, the Constitution India has been successfully guiding the path and progress of India.<p>          Generally, all Constitutions are divided into two categories viz., federal and unitary. Under the unitary Constitution the powers of the Government are centralized in one Government and that is generally the central Government and the States are subordinate to it. <p>    While in a federal Constitution there is division of powers between the Centre and the States and both are independent as well as co-ordinate to each other. A federal Constitution has following essential characteristics:<p>1) <strong>Distribution of Powers:</strong> A federal Constitution defines and demarcates the sphere of the Central and State Governments. Each Government has to act within its own sphere and cannot encroach upon the field of others.<p>    The basis of such distribution of powers between Centre and State is that the matters which are of national importance said in which uniform policy is desirable are given to the Centre and the matters which are of local importance are given to the States for legislation and control.<p>2) <strong>Supremacy of the Constitution:</strong> Under a federal system, Constitution is supreme. All organs of the Government have to work within the spheres assigned to them by the Constitution and they cannot encroach upon the jurisdiction of other organs. The judiciary has to interpret the Constitution and has to see that there is no transgression of jurisdiction by different organs of the government in the spheres assigned to others. The disputes between different organs of the Government are settled according to the provisions of the Constitution.<p>3) <strong>Effective Role of the Courts:</strong> The courts under a federal Constitution have the final authority to interpret the Constitution and maintain the supremacy of the Constitution. They decide the disputes between the Central and State Governments. Their decisions on inter-governmental disputes are final. Besides, the courts are the savior of fundamental rights of the citizens of the country.<p>4) <strong>Rigid Constitution:</strong> The procedure for amendment of the constitution is generally rigid. It can be amended according to the procedure laid down by the Constitution<p>5) <strong>Democratic State:</strong> The Constitution of India provides for a democratic system. The authority of the government rests upon the sovereignty of the people. The people enjoy equal political rights. On the basis of these rights, the people freely participate in the process of politics. They elect their Government.<p>6) <strong>India is a Republic:</strong> The preamble declares India to be a Republic. India is not ruled by a monarch or a nominated head of state. India has an elected head of state (President of India) who wields power for a fixed term of 5 years. After every 5 years, the people of India indirectly elect their President. The salient features of the Constitution of India can be discussed as follows:<p>1. <strong>Written and Detailed Constitution:</strong> The Constitution is a wholly written document which incorporates the constitutional law of India. It was fully debated and duly enacted by the Constituent Assembly of India. It took the Assembly 2 years, 11 months and 18 days to write and enact the Constitution. Indian Constitution is a very detailed constitution. It consists of 395 Articles divided into 22 parts with 12 schedules.<p>2. <strong>Federalism and Unitarianism:</strong> While describing India as a Union of states, the Constitution of India has federal structure with a unitary spirit. Scholars described it quasi federal, where or as ‘a federation with a unitary bias.<p><strong>Like a federation, the Constitution of India provides for:</strong><p>     (i) A division of powers between the centre and states,<p>     (ii) A written, rigid and supreme constitution,<p>     (iii) Independent judiciary with the power to decide centre-state disputes and<p>     (iv) Dual administration i.e. central and state administrations. However, by providing a very strong centre, a common constitution, single citizenship, emergency provisions, common election commission, common all India services etc. The Constitution clearly reflects its unitary spirit.<p>    India is a federation with some Unitarian features. This mixture of federalism Unitarianism has been done keeping in view both the pluralistic nature of society and the presence of regional diversities, as well as due to the need for securing unity and integrity of the nation.<p>3. <strong>Rigidity and Flexibility:</strong> The Constitution of India is rigid in parts. Some of its provisions can be amended in a difficult way while others can be amended very easily. In some cases, the Union parliament can amend some parts of the Constitution by passing a simple law.<p>4. <strong>Fundamental Rights:</strong> Under its Part IIIC (Article 12-35), the Constitution of India grants and guarantees Fundamental Rights to its citizens. It is called the Indian Bill of Rights. Initially, 7 Fundamental Rights were granted but after the deletion of the Right to Property from the list of Fundamental Rights (44th Amendment Act 1979) their number came down to six.<p>5. <strong>Directive Principles of State Policy:</strong> Part IV of the Constitution dealing with the ‘Directive Principles of State Policy’ provides one of the most striking features of the Indian Constitution. The Directive Principles are instructions to the state for securing socio-economic developmental objectives through its policies. These are to be implemented by both the Union for the states.<p>6. <strong>Bi- cameral Union Parliament:</strong> The Constitution provides for a Bicameral Legislature at the Union level and names it as the Union parliament. Its two Houses are: The Lok Sabha and the Rajya Sabha. The Lok Sabha is the lower, popular, directly elected house of the Parliament. It represents the people of India.<p>7. <strong>Parliamentary System:</strong> The Constitution of India provides for a parliamentary system of Government at the Centre as well as in every State of the Union. The President of India is the Constitutional head of state with nominal powers. The Union Council of Ministers headed by the Prime Minister is the real executive. Ministers are essentially the members of the Union parliament.<p>8. <strong>Adult- Suffrage:</strong> Another feature of the Constitution is that it provides for universal adult suffrage. All men and women enjoy an equal right to vote. Each adult man and woman above the age of 18 years has the right to vote. All registered voters get the opportunity to vote in elections.<p>9. <strong>Emergency Provisions:</strong> The Constitution of India contains special provisions for dealing with emergencies. It recognises three types of possible emergencies:<p>        (i) National Emergency (Article 352) an emergency resulting from war or external aggression or threat of external aggressions against India or from armed rebellion within India or in any of its part;<p>       (ii) Constitutional Emergency in a state (Article 356) an emergency resulting from the failure of constitutional machinery in any state; or some states and<p>      (iii) Financial Emergency (Article 360) an emergency resulting from a threat to financial stability of India.<p>    The President of India has been empowered to take appropriate steps for dealing with these emergencies. During the period of an emergency, the powers of the President, actually of the PM and the Union Council of Ministers Cabinet increases tremendously. President can take all steps deemed essential for meeting an emergency. These are called emergency powers of the President."
      },
      {
        "id": 2,
        "title": "",
        "description": ""
      },
      {
        "id": 3,
        "title": "",
        "description": ""
      },
      {
        "id": 4,
        "title": "",
        "description": ""
      },
      {
        "id": 5,
        "title": "",
        "description": ""
      },
      {
        "id": 6,
        "title": "",
        "description": ""
      },
      {
        "id": 7,
        "title": "",
        "description": ""
      },
      {
        "id": 8,
        "title": "",
        "description": ""
      },
      {
        "id": 9,
        "title": "",
        "description": ""
      },
      {
        "id": 10,
        "title": "",
        "description": ""
      },
      {
        "id": 11,
        "title": "",
        "description": ""
      },
      {
        "id": 12,
        "title": "",
        "description": ""
      },
      {
        "id": 13,
        "title": "",
        "description": ""
      },
      {
        "id": 14,
        "title": "",
        "description": ""
      },
      {
        "id": 14,
        "title": "",
        "description": ""
      },
      {
        "id": 15,
        "title": "",
        "description": ""
      },
      {
        "id": 16,
        "title": "",
        "description": ""
      },
      {
        "id": 17,
        "title": "",
        "description": ""
      }
    ]
  },
  {
    "_id": 2,
    "name": "Module II",
    "list": [
      {}
    ]
  },
  {
    "_id": 3,
    "name": "Module III",
    "list": [
      {}
    ]
  },
  {
    "_id": 4,
    "name": "Module IV",
    "list": [
      {}
    ]
  }
]